<?php

namespace Database\Seeders;

use App\Models\Category;
use App\Models\Good;
use App\Models\News;
use App\Models\Product;
use App\Models\Project;
use App\Models\Video;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\File;

class CategorySeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $this->runNewsCategories();
        $this->runProjectCategories();
        $this->runVideoCategories();
        $this->runProductCategories();
        $this->runGoodCategories();
    }

    public function runNewsCategories()
    {
        $data = [
            ['name' => 'Новини комнанії'],
            ['name' => 'Публікації'],
            ['name' => 'Новини школи'],
        ];

        foreach ($data as $item) {
            $attrs['type'] = News::class;
            $attrs['name'] = $item['name'];
            $attrs['seo_title'] = $item['name'];
            $attrs['seo_description'] = $item['name'];
            $attrs['seo_keywords'] = $item['name'];
            $category = Category::factory()->create($attrs);
        }
    }

    public function runProjectCategories()
    {
        $data = [
            [
                'name' => 'Торгівля',
            ],
            [
                'name' => 'Медицина',
            ],
            [
                'name' => 'Логістика',
            ],
            [
                'name' => 'Виробництво',
            ],
            [
                'name' => 'Будівництво та нерухомість',
            ],
            [
                'name' => 'Галузі харчування',
            ],
        ];

        foreach ($data as $item) {
            $attrs['type'] = Project::class;
            $attrs['name'] = $item['name'];
            $attrs['seo_title'] = $item['name'];
            $attrs['seo_description'] = $item['name'];
            $attrs['seo_keywords'] = $item['name'];
            if ($item['slug'] ?? false) {
                $attrs['slug'] = $item['slug'];
            }
            $category = Category::factory()->create($attrs);
        }
    }

    public function runVideoCategories()
    {
        $data = [
            [
                'name' => 'Навчання',
            ],
            [
                'name' => 'Інструкції',
            ],
            [
                'name' => 'Огляди',
            ],
        ];

        foreach ($data as $item) {
            $attrs['type'] = Video::class;
            $attrs['name'] = $item['name'];
            $attrs['seo_title'] = $item['name'];
            $attrs['seo_description'] = $item['name'];
            $attrs['seo_keywords'] = $item['name'];
            if ($item['slug'] ?? false) {
                $attrs['slug'] = $item['slug'];
            }
            $category = Category::factory()->create($attrs);
        }
    }

    public function runProductCategories()
    {
        $data = [
            [
                'home' => 1,
                'image' => 'cc1.png',
                'background' => 'c2.svg',
                'name' => 'BAS',
                'slug' => 'bas-products',
                'description' => '<p><div class="anons">Якщо ви шукаєте оптимальний варіант для автоматизації вашого бізнесу, то сімейство програм BAS чудово для цього підходить.</div><div class="description"><div class="desc-title">Ознайомтесь з нашим каталогом або зверніться до нас і ми допоможемо вам визначитись</div><p>Яку саме програму BAS вам необхідно придбати. Наш досвід допоможе підібрати вам найоптимальніший варіант саме для вашого бізнесу.</p></div></p>',
                'description_short' => '<p><div class="anons">Якщо ви шукаєте оптимальний варіант для автоматизації вашого бізнесу, то сімейство програм BAS чудово для цього підходить.</div><div class="description"><div class="desc-title">Ознайомтесь з нашим каталогом або зверніться до нас і ми допоможемо вам визначитись</div><p>Яку саме програму BAS вам необхідно придбати. Наш досвід допоможе підібрати вам найоптимальніший варіант саме для вашого бізнесу.</p></div></p>',
                'content' => '',
            ],
            [
                'home' => 1,
                'image' => 'o44.svg',
                'background' => 'o4.svg',
                'name' => 'CRM-системи',
                'description_short' => '<p>Програмний продукт "BAS Бухгалтерія" є призначеним для автоматизації бухгалтерського і податкового обліку, зокрема й підготовки обов\'язкової (регламентованої) звітності, в організаціях, що здійснюють будь-які види комерційної діяльності: гуртову і роздрібну торгівлю, комісійну торгівлю (включно з субкомісією), надання послуг, виробництво тощо. Бухгалтерський та податковий облік ведеться відповідно до чинного законодавства України.</p>',
                'description' => '<p>"BAS Бухгалтерія" забезпечує вирішення всіх завдань, що стоять перед бухгалтерською службою підприємства, якщо бухгалтерська служба повністю відповідає за облік на підприємстві, серед іншого, наприклад, виписку первинних документів, облік продажів тощо. Це прикладне рішення також можна використовувати виключно для ведення бухгалтерського та податкового обліку, а завдання автоматизації інших служб, наприклад, відділу продажів, вирішувати спеціалізованими прикладними рішеннями BAS або іншими системами. До складу "BAS Бухгалтерії" включено план рахунків бухгалтерського обліку, що відповідає Наказу Міністерства Фінансів України "Про затвердження Плану рахунків бухгалтерського обліку і Інструкції про його використання" від 30 листопада 1999 р. №291. Склад рахунків, організація аналітичного, валютного, кількісного обліку на рахунках відповідають вимогам законодавства щодо ведення бухгалтерського обліку та відображення даних у звітності. За необхідності користувачі можуть самостійно створювати додаткові субрахунки і розрізи аналітичного обліку.</p>',
                'content' => '<div class="for-menus"><div class="solutions-item solutions-item--solution is-intersecting" id="menu-1"><div class="title-small">Облік "від документа" та типові операції</div><p> "BAS Бухгалтерія" забезпечує вирішення всіх завдань, що стоять перед бухгалтерською службою підприємства, якщо бухгалтерська служба повністю відповідає за облік на підприємстві, серед іншого, наприклад, виписку первинних документів, облік продажів тощо. Це прикладне рішення також можна використовувати виключно для ведення бухгалтерського та податкового обліку, а завдання автоматизації інших служб, наприклад, відділу продажів, вирішувати спеціалізованими прикладними рішеннями BAS або іншими системами. До складу "BAS Бухгалтерії" включено план рахунків бухгалтерського обліку, що відповідає Наказу Міністерства Фінансів України "Про затвердження Плану рахунків бухгалтерського обліку і Інструкції про його використання" від 30 листопада 1999 р. №291. Склад рахунків, організація аналітичного, валютного, кількісного обліку на рахунках відповідають вимогам законодавства щодо ведення бухгалтерського обліку та відображення даних у звітності. За необхідності користувачі можуть самостійно створювати додаткові субрахунки і розрізи аналітичного обліку. </p></div><div class="solutions-item solutions-item--solution" id="menu-2"><div class="title-small">Ведення обліку діяльності кількох організацій</div><p>За допомогою "BAS Бухгалтерії" можна вести бухгалтерський та податковий облік господарської діяльності кількох організацій. Облік для кожної організації можна вести в окремій інформаційній базі. Водночас "BAS Бухгалтерія" надає можливість ведення бухгалтерського та податкового обліку кількох організацій у загальній інформаційній базі (в цьому випадку в ролі окремих організацій можуть виступати фізичні особи – підприємці). Це зручно, якщо їх господарська діяльність тісно пов\'язана між собою: можна використовувати загальні списки товарів, контрагентів (ділових партнерів), співробітників, складів (місць зберігання) тощо, а обов\'язкову звітність формувати окремо.</p></div><div class="solutions-item solutions-item--solution" id="menu-3"><div class="title-small">Облік товарно-матеріальних цінностей</div><p>Облік товарів, матеріалів і готової продукції реалізовано згідно П(С)БО 9 "Запаси" і методичних вказівок з його застосування. Підтримуються такі способи оцінки матеріально-виробничих запасів під час їхнього вибуття:</p><ul class="ul-custom-2"><li>За середньою собівартістю</li><li>За собівартістю перших за часом придбання матеріально-виробничих запасів (спосіб ФІФО) </li><li>За ціною продажу із застосуванням середнього відсотка націнки (для роздрібної торгівлі) </li></ul><p>Для підтримки способів оцінки ФІФО на рахунках обліку матеріально-виробничих запасів ведеться партіонний облік. Різні способи оцінки можуть застосовуватися незалежно для кожної організації.</p></div><div class="solutions-item solutions-item--solution" id="menu-4"><div class="title-small">Ведення обліку діяльності кількох організацій</div><p>За допомогою "BAS Бухгалтерії" можна вести бухгалтерський та податковий облік господарської діяльності кількох організацій. Облік для кожної організації можна вести в окремій інформаційній базі. Водночас "BAS Бухгалтерія" надає можливість ведення бухгалтерського та податкового обліку кількох організацій у загальній інформаційній базі (в цьому випадку в ролі окремих організацій можуть виступати фізичні особи – підприємці). Це зручно, якщо їх господарська діяльність тісно пов\'язана між собою: можна використовувати загальні списки товарів, контрагентів (ділових партнерів), співробітників, складів (місць зберігання) тощо, а обов\'язкову звітність формувати окремо.</p></div><div class="solutions-item solutions-item--solution" id="menu-5"><div class="title-small">Ведення обліку діяльності кількох організацій</div><p>За допомогою "BAS Бухгалтерії" можна вести бухгалтерський та податковий облік господарської діяльності кількох організацій. Облік для кожної організації можна вести в окремій інформаційній базі. Водночас "BAS Бухгалтерія" надає можливість ведення бухгалтерського та податкового обліку кількох організацій у загальній інформаційній базі (в цьому випадку в ролі окремих організацій можуть виступати фізичні особи – підприємці). Це зручно, якщо їх господарська діяльність тісно пов\'язана між собою: можна використовувати загальні списки товарів, контрагентів (ділових партнерів), співробітників, складів (місць зберігання) тощо, а обов\'язкову звітність формувати окремо.</p></div><div class="solutions-item solutions-item--solution" id="menu-6"><div class="title-small">Ведення обліку діяльності кількох організацій</div><p>За допомогою "BAS Бухгалтерії" можна вести бухгалтерський та податковий облік господарської діяльності кількох організацій. Облік для кожної організації можна вести в окремій інформаційній базі. Водночас "BAS Бухгалтерія" надає можливість ведення бухгалтерського та податкового обліку кількох організацій у загальній інформаційній базі (в цьому випадку в ролі окремих організацій можуть виступати фізичні особи – підприємці). Це зручно, якщо їх господарська діяльність тісно пов\'язана між собою: можна використовувати загальні списки товарів, контрагентів (ділових партнерів), співробітників, складів (місць зберігання) тощо, а обов\'язкову звітність формувати окремо.</p></div></div>',
            ],
        ];

        foreach ($data as $item) {
            $attrs['type'] = Product::class;
            $attrs['name'] = $item['name'];
            $attrs['description'] = $item['description'];
            $attrs['description_short'] = $item['description_short'];
            $attrs['content'] = $item['content'];
            $attrs['seo_title'] = $item['name'];
            $attrs['seo_description'] = $item['name'];
            $attrs['seo_keywords'] = $item['name'];
            if ($item['slug'] ?? false) {
                $attrs['slug'] = $item['slug'];
            }
            $attrs['home'] = $item['home'];
            $category = Category::factory()->create($attrs);
            File::copy(public_path('images/'.$item['image']), resource_path('images/'.$item['image']));
            $category->addMedia(resource_path('images/'.$item['image']))->toMediaCollection('image');
            File::copy(public_path('images/'.$item['background']), resource_path('images/'.$item['background']));
            $category->addMedia(resource_path('images/'.$item['background']))->toMediaCollection('background');
        }
    }

    public function runGoodCategories()
    {
        $data = [
            [
                'image' => 'g5.png',
                'home' => 1,
                'name' => 'Реєстратори розрахункових операцій',
                'description' => 'Реєстратори розрахункових операцій',
                'children' => [
                    ['name' => 'Касові апарати'],
                    ['name' => 'Фіскальні реєстратори'],
                    ['name' => 'Дисплеї покупця'],
                ],
            ],
            [
                'image' => 'g2.png',
                'home' => 1,
                'name' => 'Сканери штрихкодів',
                'description' => 'Сканери штрихкодів',
                'children' => [
                    ['name' => 'Ручні провідні'],
                    ['name' => 'Багатоплощинні'],
                    ['name' => 'Безпровідні'],
                    ['name' => 'Стаціонарні'],
                ],
            ],
            [
                'image' => 'g3.png',
                'home' => 1,
                'name' => 'Принтери чеків',
                'description' => 'Принтери чеків',
                'children' => [
                    ['name' => 'Мобільні'],
                    ['name' => 'Настільні'],
                ],
            ],
            [
                'image' => 'c4.png',
                'home' => 0,
                'name' => 'Лічильники банкнот',
                'description' => 'Лічильники банкнот',
                'children' => [
                    ['name' => 'Льчильники'],
                    ['name' => 'Сортувальники'],
                ],
            ],
            [
                'image' => 'g1.png',
                'home' => 1,
                'name' => 'POS-системи',
                'description' => 'POS-системи',
                'children' => [
                    ['name' => 'POS-термінали'],
                    ['name' => 'POS-монітори'],
                    ['name' => 'Ваги платформи'],
                ],
            ],
            [
                'image' => 'g6.png',
                'home' => 1,
                'name' => 'Ваги',
                'description' => 'Ваги',
                'children' => [
                    ['name' => 'Торгові'],
                    ['name' => 'Ваги з чекодруком'],
                    ['name' => 'Ваги платформи'],
                ],
            ],
            [
                'image' => 'g8.png',
                'home' => 1,
                'name' => 'Витратні матеріали',
                'description' => 'Витратні матеріали',
                'children' => [
                    ['name' => 'Касові стрічки'],
                    ['name' => 'Ектикетки'],
                ],
            ],
            [
                'image' => 'c8.png',
                'home' => 0,
                'name' => 'Принтери етикеток',
                'description' => 'Принтери етикеток',
                'children' => [
                    ['name' => 'Настільні'],
                    ['name' => 'Промислові'],
                ],
            ],
            [
                'image' => 'g7.png',
                'home' => 1,
                'name' => 'Термінали збору данних',
                'description' => 'Термінали збору данних',
                'children' => [],
            ],
            [
                'image' => 'c10.png',
                'home' => 0,
                'name' => 'Детектори валют',
                'description' => 'Детектори валют',
                'children' => [],
            ],
            [
                'image' => 'c11.png',
                'home' => 0,
                'name' => 'Термінали самообслуговування',
                'description' => 'Термінали самообслуговування',
                'children' => [],
            ],
            [
                'image' => 'g4.png',
                'home' => 1,
                'name' => 'Грошові скриньки',
                'description' => 'Грошові скриньки',
                'children' => [],
            ],
        ];

        foreach ($data as $item) {
            $attrs['type'] = Good::class;
            $attrs['name'] = $item['name'];
            $attrs['description_short'] = $item['description'];
            $attrs['seo_title'] = $item['name'];
            $attrs['seo_description'] = $item['name'];
            $attrs['seo_keywords'] = $item['name'];
            if ($item['slug'] ?? false) {
                $attrs['slug'] = $item['slug'];
            }
            $attrs['home'] = $item['home'];
            $category = Category::factory()->create($attrs);
            File::copy(public_path('images/'.$item['image']), resource_path('images/'.$item['image']));
            $category->addMedia(resource_path('images/'.$item['image']))->toMediaCollection('image');

            foreach ($item['children'] as $child) {
                $child['type'] = Good::class;
                $category->children()->create($child);
            }
        }
    }
}
