<?php

namespace Database\Seeders;

use App\Models\Course;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\File;

class CourseSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $data = [
            [
                'title' => 'Офлайн, м.Львів вул.Наукова, 7а (3-й поверх)',
                'name' => 'Курс «Використання прикладного рішення "Бухгалтерія"»',
                'description' => '12 занять по 2 год. / 3 600 грн',
                'description_short' => 'Курс розроблений методистами Спілки Автоматизаторів Бізнесу та розрахований на фахівців, що володіють базовими знаннями бухгалтерського та податкового обліку.',
                'detail' => 'Серед слухачів курсу багато користувачів старої версії програми, студентів та випускників навчальних закладів економіко-бухгалтерського спрямування, яким знання нової версії "BAS Бухгалтерія" необхідне для роботи. Кваліфіковані викладачі, атестовані Спілкою Автоматизаторів Бізнесу, допоможуть освоїти функціонал програми, зрозуміти основні принципи її використання та закріпити навички роботи з нею. Усі слухачі курсу безкоштовно забезпечуються підручниками.',
                'program' => [
                    ['title' => 'Старт системи'],
                    ['title' => 'Облік запасівv'],
                    ['title' => 'Облік взаєморозрахунків з контрагентами'],
                    ['title' => 'Облік операцій з грошовими коштами та розрахунків з підзвітними особами'],
                    ['title' => 'Облік ПДВ'],
                    ['title' => 'Облік кадрів та розрахунок заробітної плати'],
                    ['title' => 'Облік необоротних активів та малоцінних швидкозношуваних предметів'],
                    ['title' => 'Облік отримання та надання послуг'],
                    ['title' => 'Закриття періоду'],
                    ['title' => 'Облік виробничої діяльності'],
                    ['title' => 'Облік операцій в іноземній валюті'],
                    ['title' => 'Облік операцій в іноземній валюті'],
                    ['title' => 'Звіти для керівника підприємства'],
                ],
                'certificate_text' => '<p><div class="title">А як щодо сертификату?</div><p>Звичайно ж, всі студенти навчального центру після успішного завершення курсів отримують сертифікат, який підтверджує проходження однієї з програм.</p><p class="p-last">Сертифікат, безсумнівно, буде додатковою перевагою при вашому подальшому працевлаштуванні.</p></p>',
                'image' => 'study1.jpg',
                'certificate' => 'cert.jpg',
            ],
            [
                'title' => 'Тестування Онлайн',
                'name' => 'Тестування “Професіонал”',
                'description' => 'Вартість тестування 360 грн',
                'description_short' => 'Курс розроблений методистами Спілки Автоматизаторів Бізнесу та розрахований на фахівців, що володіють базовими знаннями бухгалтерського та податкового обліку.',
                'detail' => 'Серед слухачів курсу багато користувачів старої версії програми, студентів та випускників навчальних закладів економіко-бухгалтерського спрямування, яким знання нової версії "BAS Бухгалтерія" необхідне для роботи. Кваліфіковані викладачі, атестовані Спілкою Автоматизаторів Бізнесу, допоможуть освоїти функціонал програми, зрозуміти основні принципи її використання та закріпити навички роботи з нею. Усі слухачі курсу безкоштовно забезпечуються підручниками.',
                'program' => [
                    ['title' => 'Старт системи'],
                    ['title' => 'Облік запасівv'],
                    ['title' => 'Облік взаєморозрахунків з контрагентами'],
                    ['title' => 'Облік операцій з грошовими коштами та розрахунків з підзвітними особами'],
                    ['title' => 'Облік ПДВ'],
                    ['title' => 'Облік кадрів та розрахунок заробітної плати'],
                    ['title' => 'Облік необоротних активів та малоцінних швидкозношуваних предметів'],
                    ['title' => 'Облік отримання та надання послуг'],
                    ['title' => 'Закриття періоду'],
                    ['title' => 'Облік виробничої діяльності'],
                    ['title' => 'Облік операцій в іноземній валюті'],
                    ['title' => 'Облік операцій в іноземній валюті'],
                    ['title' => 'Звіти для керівника підприємства'],
                ],
                'certificate_text' => '<p><div class="title">А як щодо сертификату?</div><p>Звичайно ж, всі студенти навчального центру після успішного завершення курсів отримують сертифікат, який підтверджує проходження однієї з програм.</p><p class="p-last">Сертифікат, безсумнівно, буде додатковою перевагою при вашому подальшому працевлаштуванні.</p></p>',
                'image' => 'study2.jpg',
                'certificate' => 'cert.jpg',
            ],
        ];

        foreach ($data as $item) {
            $attrs['title'] = $item['title'];
            $attrs['name'] = $item['name'];
            $attrs['description_short'] = $item['description'];
            $attrs['description'] = $item['description'];
            $attrs['detail'] = $item['detail'];
            $attrs['content'] = $item['content'] ?? '';
            $attrs['certificate_text'] = $item['certificate_text'];
            $attrs['program'] = $item['program'];
            $attrs['seo_title'] = $item['name'];
            $attrs['seo_description'] = $item['name'];
            $attrs['seo_keywords'] = $item['name'];
            $course = Course::factory()->create($attrs);
            File::copy(public_path('images/'.$item['image']), resource_path('images/'.$item['image']));
            $course->addMedia(resource_path('images/'.$item['image']))->toMediaCollection('image');
            File::copy(public_path('images/'.$item['certificate']), resource_path('images/'.$item['certificate']));
            $course->addMedia(resource_path('images/'.$item['certificate']))->toMediaCollection('certificate');
        }
    }
}
