<?php

namespace Database\Seeders;

use App\Models\Category;
use App\Models\Product;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\File;

class ProductSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $data = [
            [
                'image' => 'icon9.svg',
                'name' => 'BAS Бухгалтерія',
                'description' => '<p><div class="col-anons">Готовий інструмент для вирішення всіх завдань, що стоять перед бухгалтерською службою підприємства, якщо бухгалтерська служба повністю відповідає за облік на підприємстві, включаючи, наприклад, виписку первинних документів, облік продажів тощо.</div></p>',
            ],
            [
                'image' => 'icon9.svg',
                'name' => 'BAS Комплексне управління підприємством',
                'description' => '<p><div class="col-anons">Готовий інструмент для вирішення всіх завдань, що стоять перед бухгалтерською службою підприємства, якщо бухгалтерська служба повністю відповідає за облік на підприємстві, включаючи, наприклад, виписку первинних документів, облік продажів тощо.</div></p>',
            ],
            [
                'image' => 'icon9.svg',
                'name' => 'BAS Управлінн торгівлею',
                'description' => '<p><div class="col-anons">Готовий інструмент для вирішення всіх завдань, що стоять перед бухгалтерською службою підприємства, якщо бухгалтерська служба повністю відповідає за облік на підприємстві, включаючи, наприклад, виписку первинних документів, облік продажів тощо.</div></p>',
            ],
            [
                'image' => 'icon9.svg',
                'name' => 'BAS Роздрібна торгівля',
                'description' => '<p><div class="col-anons">Готовий інструмент для вирішення всіх завдань, що стоять перед бухгалтерською службою підприємства, якщо бухгалтерська служба повністю відповідає за облік на підприємстві, включаючи, наприклад, виписку первинних документів, облік продажів тощо.</div></p>',
            ],
            [
                'image' => 'icon9.svg',
                'name' => 'BAS Малий бізнес',
                'description' => '<p><div class="col-anons">Готовий інструмент для вирішення всіх завдань, що стоять перед бухгалтерською службою підприємства, якщо бухгалтерська служба повністю відповідає за облік на підприємстві, включаючи, наприклад, виписку первинних документів, облік продажів тощо.</div></p>',
            ],
            [
                'image' => 'icon9.svg',
                'name' => 'BAS ERP',
                'description' => '<p><div class="col-anons">Готовий інструмент для вирішення всіх завдань, що стоять перед бухгалтерською службою підприємства, якщо бухгалтерська служба повністю відповідає за облік на підприємстві, включаючи, наприклад, виписку первинних документів, облік продажів тощо.</div></p>',
            ],
            [
                'image' => 'icon9.svg',
                'name' => 'BAS АГРО. ERP',
                'description' => '<p><div class="col-anons">Готовий інструмент для вирішення всіх завдань, що стоять перед бухгалтерською службою підприємства, якщо бухгалтерська служба повністю відповідає за облік на підприємстві, включаючи, наприклад, виписку первинних документів, облік продажів тощо.</div></p>',
            ],
            [
                'image' => 'icon9.svg',
                'name' => 'BAS Документообіг КОРП',
                'description' => '<p><div class="col-anons">Готовий інструмент для вирішення всіх завдань, що стоять перед бухгалтерською службою підприємства, якщо бухгалтерська служба повністю відповідає за облік на підприємстві, включаючи, наприклад, виписку первинних документів, облік продажів тощо.</div></p>',
            ],
            [
                'image' => 'icon9.svg',
                'name' => 'BAS Медицина',
                'description' => '<p><div class="col-anons">Готовий інструмент для вирішення всіх завдань, що стоять перед бухгалтерською службою підприємства, якщо бухгалтерська служба повністю відповідає за облік на підприємстві, включаючи, наприклад, виписку первинних документів, облік продажів тощо.</div></p>',
            ],
            [
                'image' => 'icon9.svg',
                'name' => 'BAS Комплексне управління паливним підприємством',
                'description' => '<p><div class="col-anons">Готовий інструмент для вирішення всіх завдань, що стоять перед бухгалтерською службою підприємства, якщо бухгалтерська служба повністю відповідає за облік на підприємстві, включаючи, наприклад, виписку первинних документів, облік продажів тощо.</div></p>',
            ],
            [
                'image' => 'icon9.svg',
                'name' => 'BAS Управління автотранспортом',
                'description' => '<p><div class="col-anons">Готовий інструмент для вирішення всіх завдань, що стоять перед бухгалтерською службою підприємства, якщо бухгалтерська служба повністю відповідає за облік на підприємстві, включаючи, наприклад, виписку первинних документів, облік продажів тощо.</div></p>',
            ],
            [
                'image' => 'icon9.svg',
                'name' => 'BAS Управління холдингом',
                'description' => '<p><div class="col-anons">Готовий інструмент для вирішення всіх завдань, що стоять перед бухгалтерською службою підприємства, якщо бухгалтерська служба повністю відповідає за облік на підприємстві, включаючи, наприклад, виписку первинних документів, облік продажів тощо.</div></p>',
            ],
            [
                'image' => 'o11.svg',
                'background' => 'o1.svg',
                'name' => 'PROСкануй',
                'description' => '<p><div class="col-anons">Готовий інструмент для вирішення всіх завдань, що стоять перед бухгалтерською службою підприємства, якщо бухгалтерська служба повністю відповідає за облік на підприємстві, включаючи, наприклад, виписку первинних документів, облік продажів тощо.</div></p>',
            ],
            [
                'image' => 'o22.svg',
                'background' => 'o2.svg',
                'name' => 'PROДавай',
                'description' => '<p><div class="col-anons">Готовий інструмент для вирішення всіх завдань, що стоять перед бухгалтерською службою підприємства, якщо бухгалтерська служба повністю відповідає за облік на підприємстві, включаючи, наприклад, виписку первинних документів, облік продажів тощо.</div></p>',
            ],
            [
                'image' => 'o33.svg',
                'background' => 'o3.svg',
                'name' => 'Dilosoft',
                'description' => '<p><div class="col-anons">Готовий інструмент для вирішення всіх завдань, що стоять перед бухгалтерською службою підприємства, якщо бухгалтерська служба повністю відповідає за облік на підприємстві, включаючи, наприклад, виписку первинних документів, облік продажів тощо.</div></p>',
            ],
            [
                'image' => 'o44.svg',
                'background' => 'o4.svg',
                'name' => 'CRM-системи',
                'description' => '<p><div class="col-anons">Готовий інструмент для вирішення всіх завдань, що стоять перед бухгалтерською службою підприємства, якщо бухгалтерська служба повністю відповідає за облік на підприємстві, включаючи, наприклад, виписку первинних документів, облік продажів тощо.</div></p>',
            ],
        ];

        $category = Category::query()->where('slug', 'bas-products')->first();

        foreach ($data as $i => $item) {
            $attrs['name'] = $item['name'];
            $attrs['description'] = $item['description'];
            $attrs['description_short'] = $item['description'];
            $attrs['seo_title'] = $item['name'];
            $attrs['seo_description'] = $item['name'];
            $attrs['seo_keywords'] = $item['name'];
            $product = Product::factory()->afterCreating(function (Product $product) {
                File::copy(public_path('images/icon8.svg'), resource_path('images/icon8.svg'));
                $product->addMedia(resource_path('images/icon8.svg'))->toMediaCollection('image');
            })->create($attrs);
            File::copy(public_path('images/'.$item['image']), resource_path('images/'.$item['image']));
            $product->addMedia(resource_path('images/'.$item['image']))->toMediaCollection('image');

            if (isset($item['background'])) {
                File::copy(public_path('images/'.$item['background']), resource_path('images/'.$item['background']));
                $product->addMedia(resource_path('images/'.$item['background']))->toMediaCollection('background');
            }

            if ($i < 12) {
                $product->categories()->sync([$category->id]);
            }
        }
    }
}
