<?php

namespace Database\Seeders;

use App\Models\Product;
use Illuminate\Database\Seeder;

class ProductUsageSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $products = Product::query()->get();

        foreach ($products as $product) {
            $product->update([
                'usage' => [
                    [
                        'title' => 'Облік "від документа" та типові операції',
                        'text' => '"BAS Бухгалтерія" забезпечує вирішення всіх завдань, що стоять перед бухгалтерською службою підприємства, якщо бухгалтерська служба повністю відповідає за облік на підприємстві, серед іншого, наприклад, виписку первинних документів, облік продажів тощо. Це прикладне рішення також можна використовувати виключно для ведення бухгалтерського та податкового обліку, а завдання автоматизації інших служб, наприклад, відділу продажів, вирішувати спеціалізованими прикладними рішеннями BAS або іншими системами. До складу "BAS Бухгалтерії" включено план рахунків бухгалтерського обліку, що відповідає Наказу Міністерства Фінансів України "Про затвердження Плану рахунків бухгалтерського обліку і Інструкції про його використання" від 30 листопада 1999 р. №291. Склад рахунків, організація аналітичного, валютного, кількісного обліку на рахунках відповідають вимогам законодавства щодо ведення бухгалтерського обліку та відображення даних у звітності. За необхідності користувачі можуть самостійно створювати додаткові субрахунки і розрізи аналітичного обліку.',
                    ],
                    [
                        'title' => 'Ведення обліку діяльності кількох організацій',
                        'text' => 'За допомогою "BAS Бухгалтерії" можна вести бухгалтерський та податковий облік господарської діяльності кількох організацій. Облік для кожної організації можна вести в окремій інформаційній базі. Водночас "BAS Бухгалтерія" надає можливість ведення бухгалтерського та податкового обліку кількох організацій у загальній інформаційній базі (в цьому випадку в ролі окремих організацій можуть виступати фізичні особи – підприємці). Це зручно, якщо їх господарська діяльність тісно пов\'язана між собою: можна використовувати загальні списки товарів, контрагентів (ділових партнерів), співробітників, складів (місць зберігання) тощо, а обов\'язкову звітність формувати окремо.',
                    ],
                    [
                        'title' => 'Облік товарно-матеріальних цінностей',
                        'text' => '<p>Облік товарів, матеріалів і готової продукції реалізовано згідно П(С)БО 9 "Запаси" і методичних вказівок з його застосування. Підтримуються такі способи оцінки матеріально-виробничих запасів під час їхнього вибуття:</p><ul class="ul-custom-2"><li>За середньою собівартістю</li><li>За собівартістю перших за часом придбання матеріально-виробничих запасів (спосіб ФІФО) </li><li>За ціною продажу із застосуванням середнього відсотка націнки (для роздрібної торгівлі) </li></ul><p>Для підтримки способів оцінки ФІФО на рахунках обліку матеріально-виробничих запасів ведеться партіонний облік. Різні способи оцінки можуть застосовуватися незалежно для кожної організації.</p>',
                    ],
                    [
                        'title' => 'Ведення обліку діяльності кількох організацій',
                        'text' => 'За допомогою "BAS Бухгалтерії" можна вести бухгалтерський та податковий облік господарської діяльності кількох організацій. Облік для кожної організації можна вести в окремій інформаційній базі. Водночас "BAS Бухгалтерія" надає можливість ведення бухгалтерського та податкового обліку кількох організацій у загальній інформаційній базі (в цьому випадку в ролі окремих організацій можуть виступати фізичні особи – підприємці). Це зручно, якщо їх господарська діяльність тісно пов\'язана між собою: можна використовувати загальні списки товарів, контрагентів (ділових партнерів), співробітників, складів (місць зберігання) тощо, а обов\'язкову звітність формувати окремо.',
                    ],
                    [
                        'title' => 'Ведення обліку діяльності кількох організацій',
                        'text' => 'За допомогою "BAS Бухгалтерії" можна вести бухгалтерський та податковий облік господарської діяльності кількох організацій. Облік для кожної організації можна вести в окремій інформаційній базі. Водночас "BAS Бухгалтерія" надає можливість ведення бухгалтерського та податкового обліку кількох організацій у загальній інформаційній базі (в цьому випадку в ролі окремих організацій можуть виступати фізичні особи – підприємці). Це зручно, якщо їх господарська діяльність тісно пов\'язана між собою: можна використовувати загальні списки товарів, контрагентів (ділових партнерів), співробітників, складів (місць зберігання) тощо, а обов\'язкову звітність формувати окремо.',
                    ],
                    [
                        'title' => 'Ведення обліку діяльності кількох організацій',
                        'text' => 'За допомогою "BAS Бухгалтерії" можна вести бухгалтерський та податковий облік господарської діяльності кількох організацій. Облік для кожної організації можна вести в окремій інформаційній базі. Водночас "BAS Бухгалтерія" надає можливість ведення бухгалтерського та податкового обліку кількох організацій у загальній інформаційній базі (в цьому випадку в ролі окремих організацій можуть виступати фізичні особи – підприємці). Це зручно, якщо їх господарська діяльність тісно пов\'язана між собою: можна використовувати загальні списки товарів, контрагентів (ділових партнерів), співробітників, складів (місць зберігання) тощо, а обов\'язкову звітність формувати окремо.',
                    ],
                ],
            ]);
        }
    }
}
